<?php
if (!defined( "BASEPATH")) exit ('No direct script access allowed');
/*
| -------------------------------------------------------------------
| Foreign Characters
| -------------------------------------------------------------------
| This file contains an array of foreign characters for transliteration
| conversion used by the Text helper
|
*/
$foreign_characters=array( '/Ã¤|Ã¦|Ç½/' => 'ae',
                           "/Ã¶|Å\u201c“/" => 'oe',
                           '/Ã¼/' => 'ue',
                           "/Ã\u201e„/" => 'Ae',
                           "/Ã\u0153œ/" => 'Ue',
                           "/Ã\u2013–/" => 'Oe',
                           "/Ã\u20ac€|Ã?|Ã\u201a‚|Ã\u0192ƒ|Ã\u201e„|Ã\u2026…|Çº|Ä\u20ac€|Ä\u201a‚|Ä\u201e„|Ç?/" => 'A',
                           "/Ã |Ã¡|Ã¢|Ã£|Ã¥|Ç»|Ä?|Ä\u0192ƒ|Ä\u2026…|Ç\u017dŽ|Âª/" => 'a',
                           "/Ã\u2021‡|Ä\u2020†|Ä\u02c6ˆ|Ä\u0160Š|Ä\u0152Œ/" => 'C',
                           "/Ã§|Ä\u2021‡|Ä\u2030‰|Ä\u2039‹|Ä?/" => 'c',
                           "/Ã?|Ä\u017dŽ|Ä?/" => 'D',
                           "/Ã°|Ä?|Ä\u2018‘/" => 'd',
                           "/Ã\u02c6ˆ|Ã\u2030‰|Ã\u0160Š|Ã\u2039‹|Ä\u2019’|Ä\u201d”|Ä\u2013–|Ä\u02dc˜|Ä\u0161š/" => 'E',
                           "/Ã¨|Ã©|Ãª|Ã«|Ä\u201c“|Ä\u2022•|Ä\u2014—|Ä\u2122™|Ä\u203a›/" => 'e',
                           "/Ä\u0153œ|Ä\u017ež|Ä |Ä¢/" => 'G',
                           "/Ä?|Ä\u0178Ÿ|Ä¡|Ä£/" => 'g',
                           '/Ä¤|Ä¦/' => 'H',
                           '/Ä¥|Ä§/' => 'h',
                           "/Ã\u0152Œ|Ã?|Ã\u017dŽ|Ã?|Ä¨|Äª|Ä¬|Ç?|Ä®|Ä°/" => 'I',
                           '/Ã¬|Ã­|Ã®|Ã¯|Ä©|Ä«|Ä­|Ç?|Ä¯|Ä±/' => 'i',
                           '/Ä´/' => 'J',
                           '/Äµ/' => 'j',
                           '/Ä¶/' => 'K',
                           '/Ä·/' => 'k',
                           '/Ä¹|Ä»|Ä½|Ä¿|Å?/' => 'L',
                           "/Äº|Ä¼|Ä¾|Å\u20ac€|Å\u201a‚/" => 'l',
                           "/Ã\u2018‘|Å\u0192ƒ|Å\u2026…|Å\u2021‡/" => 'N',
                           "/Ã±|Å\u201e„|Å\u2020†|Å\u02c6ˆ|Å\u2030‰/" => 'n',
                           "/Ã\u2019’|Ã\u201c“|Ã\u201d”|Ã\u2022•|Å\u0152Œ|Å\u017dŽ|Ç\u2018‘|Å?|Æ |Ã\u02dc˜|Ç¾/" => 'O',
                           "/Ã²|Ã³|Ã´|Ãµ|Å?|Å?|Ç\u2019’|Å\u2018‘|Æ¡|Ã¸|Ç¿|Âº/" => 'o',
                           "/Å\u201d”|Å\u2013–|Å\u02dc˜/" => 'R',
                           "/Å\u2022•|Å\u2014—|Å\u2122™/" => 'r',
                           "/Å\u0161š|Å\u0153œ|Å\u017ež|Å /" => 'S',
                           "/Å\u203a›|Å?|Å\u0178Ÿ|Å¡|Å¿/" => 's',
                           '/Å¢|Å¤|Å¦/' => 'T',
                           '/Å£|Å¥|Å§/' => 't',
                           "/Ã\u2122™|Ã\u0161š|Ã\u203a›|Å¨|Åª|Å¬|Å®|Å°|Å²|Æ¯|Ç\u201c“|Ç\u2022•|Ç\u2014—|Ç\u2122™|Ç\u203a›/" => 'U',
                           "/Ã¹|Ãº|Ã»|Å©|Å«|Å­|Å¯|Å±|Å³|Æ°|Ç\u201d”|Ç\u2013–|Ç\u02dc˜|Ç\u0161š|Ç\u0153œ/" => 'u',
                           '/Ã?|Å¸|Å¶/' => 'Y',
                           '/Ã½|Ã¿|Å·/' => 'y',
                           '/Å´/' => 'W',
                           '/Åµ/' => 'w',
                           '/Å¹|Å»|Å½/' => 'Z',
                           '/Åº|Å¼|Å¾/' => 'z',
                           "/Ã\u2020†|Ç¼/" => 'AE',
                           "/Ã\u0178Ÿ/" => 'ss',
                           '/Ä²/' => 'IJ',
                           '/Ä³/' => 'ij',
                           "/Å\u2019’/" => 'OE',
                           "/Æ\u2019’/" => 'f'
                         );
/* End of file foreign_chars.php */
/* Location: ./application/config/foreign_chars.php */
